Table of Contents
 Class MatSteelAUS
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Material steel AISC
[OpenModelClass("CI.StructModel.Libraries.Material.AUS.MatSteelAUS,CI.Material", "CI.StructModel.Libraries.Material.IMaterial,CI.BasicTypes", typeof(MatSteel))]
public class MatSteelAUS : MatSteel
Inheritance
object
OpenObject
OpenElementId
Material
MatSteel
MatSteelAUS
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 MaterialStrength
Material strength for specific thickness of plate
public MaterialStrengthProperty MaterialStrength { get; set; }
Property Value
MaterialStrengthProperty
 PhiOMFu
Overstrength coefficient for fu
public double PhiOMFu { get; set; }
Property Value
double
 PhiOMFy
Overstrength coefficient for fy
public double PhiOMFy { get; set; }
Property Value
double
 fu
Default ultimate strength for nominal thickness of the element - fu
public double fu { get; set; }
Property Value
double
 fy
Default yield strength for nominal thickness of the element - fy
public double fy { get; set; }
Property Value
double
 Edit this page